TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_unicommi2ct.h
/*****************************************************************************

  Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_unicommi2ct__include
#define ti_devices_msp_peripherals_hw_unicommi2ct__include

/* Filename: hw_unicommi2ct.h */
/* Revised: 2024-07-26 01:47:37 */
/* Revision: 7272f6b6a2f4592ada400278814de80dfb9c70f1 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* UNICOMMI2CT Registers
******************************************************************************/
#define UNICOMMI2CT_SPGDMA_OFS                   ((uint32_t)0x000010B0U)
#define UNICOMMI2CT_DMA_TRIG0_OFS                ((uint32_t)0x00001080U)
#define UNICOMMI2CT_DMA_TRIG1_OFS                ((uint32_t)0x00001050U)
#define UNICOMMI2CT_CPU_INT_OFS                  ((uint32_t)0x00001020U)


/** @addtogroup UNICOMMI2CT_SPGDMA
  @{
*/

typedef struct {
       uint32_t RESERVED0;
  __IO uint32_t SPGDMARXCTL;                       /* !< (@ 0x000010B4) DMA Channel Control */
  __IO uint32_t SPGDMARXDA;                        /* !< (@ 0x000010B8) DMA Channel Destination Address */
  __IO uint32_t SPGDMARXSZ;                        /* !< (@ 0x000010BC) DMA Channel Size */
       uint32_t RESERVED1;
  __IO uint32_t SPGDMATXCTL;                       /* !< (@ 0x000010C4) DMA Channel Control */
  __IO uint32_t SPGDMATXSA;                        /* !< (@ 0x000010C8) DMA Channel Destination Address */
  __IO uint32_t SPGDMATXSZ;                        /* !< (@ 0x000010CC) DMA Channel Size */
} UNICOMMI2CT_SPGDMA_Regs;

/*@}*/ /* end of group UNICOMMI2CT_SPGDMA */

/** @addtogroup UNICOMMI2CT_DMA_TRIG0
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00001088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000010A0) Interrupt set */
} UNICOMMI2CT_DMA_TRIG0_Regs;

/*@}*/ /* end of group UNICOMMI2CT_DMA_TRIG0 */

/** @addtogroup UNICOMMI2CT_DMA_TRIG1
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001070) Interrupt set */
} UNICOMMI2CT_DMA_TRIG1_Regs;

/*@}*/ /* end of group UNICOMMI2CT_DMA_TRIG1 */

/** @addtogroup UNICOMMI2CT_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} UNICOMMI2CT_CPU_INT_Regs;

