TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_unicommi2ct.h
/*@}*/ /* end of group UNICOMMI2CT_CPU_INT */

/** @addtogroup UNICOMMI2CT
  @{
*/

typedef struct {
       uint32_t RESERVED0[1024];
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00001000) Clock Divider */
       uint32_t RESERVED1;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00001008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED2[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED3;
  UNICOMMI2CT_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED4;
  UNICOMMI2CT_DMA_TRIG1_Regs  DMA_TRIG1;                         /* !< (@ 0x00001050) */
       uint32_t RESERVED5[3];
  UNICOMMI2CT_DMA_TRIG0_Regs  DMA_TRIG0;                         /* !< (@ 0x00001080) */
       uint32_t RESERVED6[3];
  UNICOMMI2CT_SPGDMA_Regs  SPGDMA;                            /* !< (@ 0x000010B0) */
       uint32_t RESERVED7[5];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000010E4) Interrupt control register */
       uint32_t RESERVED8[6];
  __IO uint32_t CTR;                               /* !< (@ 0x00001100) I2C Target Control Register */
  __IO uint32_t ACKCTL;                            /* !< (@ 0x00001104) I2C Target ACK Control */
  __I  uint32_t SR;                                /* !< (@ 0x00001108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000110C) Interrupt FIFO Level Select Register */
       uint32_t RESERVED9[2];
  __IO uint32_t GFCTL;                             /* !< (@ 0x00001118) I2C Glitch Filter Control */
       uint32_t RESERVED10;
  __O  uint32_t TTXDATA;                           /* !< (@ 0x00001120) I2C TXData */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00001124) I2C RXData */
  __I  uint32_t PECSR;                             /* !< (@ 0x00001128) PEC status register */
       uint32_t RESERVED11[7];
  __IO uint32_t OAR2;                              /* !< (@ 0x00001148) Own Address 2 */
  __IO uint32_t OAR;                               /* !< (@ 0x0000114C) I2C Own Address */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x00001150) I2C Timeout Count Register */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x00001154) I2C Timeout Count Control Register */
  __IO uint32_t PECCTL;                            /* !< (@ 0x00001158) I2C PEC control register */
} UNICOMMI2CT_Regs;

/*@}*/ /* end of group UNICOMMI2CT */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* UNICOMMI2CT Register Control Bits
******************************************************************************/

/* UNICOMMI2CT_SPGDMARXCTL Bits */
/* UNICOMMI2CT_SPGDMARXCTL[DMAEN] Bits */
#define UNICOMMI2CT_SPGDMARXCTL_DMAEN_OFS        (1)                             /* !< DMAEN Offset */
#define UNICOMMI2CT_SPGDMARXCTL_DMAEN_MASK       ((uint32_t)0x00000002U)         /* !< DMA enable */
#define UNICOMMI2CT_SPGDMARXCTL_DMAEN_DISABLE    ((uint32_t)0x00000000U)         /* !< DMA channel disabled */
#define UNICOMMI2CT_SPGDMARXCTL_DMAEN_ENABLE     ((uint32_t)0x00000002U)         /* !< DMA channel enabled */
/* UNICOMMI2CT_SPGDMARXCTL[DMAMEMINCR] Bits */
#define UNICOMMI2CT_SPGDMARXCTL_DMAMEMINCR_OFS   (20)                            /* !< DMAMEMINCR Offset */
#define UNICOMMI2CT_SPGDMARXCTL_DMAMEMINCR_MASK  ((uint32_t)0x00100000U)         /* !< DMA destination increment. This bit
                                                                                    selects automatic incrementing or
                                                                                    decrementing of the destination
                                                                                    address DMADA for each transfer. The
                                                                                    amount of change to the DMADA is
                                                                                    based on the definition in the
                                                                                    DMADSTWDTH. For example, an increment
                                                                                    of 1 (+1) on a WORD transfer will
                                                                                    increment the DMADA by 4. */
#define UNICOMMI2CT_SPGDMARXCTL_DMAMEMINCR_INCREMENT ((uint32_t)0x00000000U)         /* !< Incremented by 1 (+1 * DMADSTWDTH) */
#define UNICOMMI2CT_SPGDMARXCTL_DMAMEMINCR_DECREMENT ((uint32_t)0x00100000U)         /* !< Decremented by 1 (-1 * DMADSTWDTH) */
/* UNICOMMI2CT_SPGDMARXCTL[DMAPREIRQ] Bits */
#define UNICOMMI2CT_SPGDMARXCTL_DMAPREIRQ_OFS    (24)                            /* !< DMAPREIRQ Offset */
#define UNICOMMI2CT_SPGDMARXCTL_DMAPREIRQ_MASK   ((uint32_t)0x01000000U)         /* !< Enable an early IRQ event. This can
                                                                                    help software to react quicker to and
                                                                                    DMA done event or allows some
                                                                                    additional configuration before the
                                                                                    channel is complete.   Note: This
                                                                                    register is only available in a
                                                                                    FULL-channel configuration. Please
                                                                                    consult the datasheet of the specific
                                                                                    device to map which channel number
                                                                                    has FULL or BASIC capability. In a
                                                                                    BASIC configuration this register is
                                                                                    a read only value and always reads as
                                                                                    0x0. */
#define UNICOMMI2CT_SPGDMARXCTL_DMAPREIRQ_PREIRQ_DISABLE ((uint32_t)0x00000000U)         /* !< Pre-IRQ event disabled. */
#define UNICOMMI2CT_SPGDMARXCTL_DMAPREIRQ_PREIRQ_HALF ((uint32_t)0x01000000U)         /* !< Issue Pre-IRQ event when DMASZ
                                                                                    reached the half size point of the
                                                                                    original transfer size */
/* UNICOMMI2CT_SPGDMARXCTL[DMATM] Bits */
#define UNICOMMI2CT_SPGDMARXCTL_DMATM_OFS        (27)                            /* !< DMATM Offset */
#define UNICOMMI2CT_SPGDMARXCTL_DMATM_MASK       ((uint32_t)0x08000000U)         /* !< DMA transfer mode register */
#define UNICOMMI2CT_SPGDMARXCTL_DMATM_SINGLE     ((uint32_t)0x00000000U)         /* !< Single transfer. Each transfer
                                                                                    requires a new trigger. When the
                                                                                    DMASZ counts down to zero an event
                                                                                    can be generated and the DMAEN is
                                                                                    cleared. */
#define UNICOMMI2CT_SPGDMARXCTL_DMATM_RPTSNGL    ((uint32_t)0x08000000U)         /* !< Repeated single transfer. Each
                                                                                    transfer requires a new trigger. When
                                                                                    the DMASZ counts down to zero an
                                                                                    event can be generated. After the
                                                                                    last transfer the DMASA, DMADA, DAMSZ
                                                                                    registers are restored to its initial
                                                                                    value and the DMAEN stays enabled. */
/* UNICOMMI2CT_SPGDMARXCTL[DMADSTWDTH] Bits */
#define UNICOMMI2CT_SPGDMARXCTL_DMADSTWDTH_OFS   (28)                            /* !< DMADSTWDTH Offset */
#define UNICOMMI2CT_SPGDMARXCTL_DMADSTWDTH_MASK  ((uint32_t)0x30000000U)         /* !< DMA destination width. This bit
                                                                                    selects the destination as a byte,
                                                                                    half word, word or long word. */
#define UNICOMMI2CT_SPGDMARXCTL_DMADSTWDTH_BYTE  ((uint32_t)0x00000000U)         /* !< Destination data width is BYTE
                                                                                    (8-bit) */
#define UNICOMMI2CT_SPGDMARXCTL_DMADSTWDTH_HALF  ((uint32_t)0x10000000U)         /* !< Destination data width is HALF-WORD
                                                                                    (16-bit) */
#define UNICOMMI2CT_SPGDMARXCTL_DMADSTWDTH_WORD  ((uint32_t)0x20000000U)         /* !< Destination data width is WORD
                                                                                    (32-bit) */

/* UNICOMMI2CT_SPGDMARXDA Bits */
/* UNICOMMI2CT_SPGDMARXDA[ADDR] Bits */
#define UNICOMMI2CT_SPGDMARXDA_ADDR_OFS          (0)                             /* !< ADDR Offset */
#define UNICOMMI2CT_SPGDMARXDA_ADDR_MASK         ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Destination Address */
#define UNICOMMI2CT_SPGDMARXDA_ADDR_MINIMUM      ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CT_SPGDMARXDA_ADDR_MAXIMUM      ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

