TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_unicommi2ct.h
/* UNICOMMI2CT_CPU_INT_IMASK Bits */
/* UNICOMMI2CT_CPU_INT_IMASK[RXDONE] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_RXDONE_OFS     (0)                             /* !< RXDONE Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_RXDONE_MASK    ((uint32_t)0x00000001U)         /* !< Receive Data Interrupt Signals that
                                                                                    a byte has been received */
#define UNICOMMI2CT_CPU_INT_IMASK_RXDONE_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_RXDONE_SET     ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[TXDONE] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_TXDONE_OFS     (1)                             /* !< TXDONE Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_TXDONE_MASK    ((uint32_t)0x00000002U)         /* !< Transmit Transaction completed
                                                                                    Interrupt */
#define UNICOMMI2CT_CPU_INT_IMASK_TXDONE_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_TXDONE_SET     ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[GENCALL] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_GENCALL_OFS    (8)                             /* !< GENCALL Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_GENCALL_MASK   ((uint32_t)0x00000100U)         /* !< General Call Interrupt */
#define UNICOMMI2CT_CPU_INT_IMASK_GENCALL_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_GENCALL_SET    ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[RXTRG] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_RXTRG_OFS      (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_RXTRG_MASK     ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CT_CPU_INT_IMASK_RXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_RXTRG_SET      ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[TXTRG] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_TXTRG_OFS      (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_TXTRG_MASK     ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CT_CPU_INT_IMASK_TXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_TXTRG_SET      ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[START] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_START_OFS      (9)                             /* !< START Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_START_MASK     ((uint32_t)0x00000200U)         /* !< Start Condition Interrupt */
#define UNICOMMI2CT_CPU_INT_IMASK_START_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_START_SET      ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[STOP] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_STOP_OFS       (10)                            /* !< STOP Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_STOP_MASK      ((uint32_t)0x00000400U)         /* !< Stop Condition Interrupt */
#define UNICOMMI2CT_CPU_INT_IMASK_STOP_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_STOP_SET       ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[DMA_DONE_TX] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[DMA_DONE_RX] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[PEC_RX_ERR] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_PEC_RX_ERR_OFS (11)                            /* !< PEC_RX_ERR Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< RX Pec Error Interrupt */
#define UNICOMMI2CT_CPU_INT_IMASK_PEC_RX_ERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_PEC_RX_ERR_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[TIMEOUTA] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTA_OFS   (12)                            /* !< TIMEOUTA Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTA_MASK  ((uint32_t)0x00001000U)         /* !< Timeout A Interrupt */
#define UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTA_CLR   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTA_SET   ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[TIMEOUTB] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTB_OFS   (13)                            /* !< TIMEOUTB Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTB_MASK  ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTB_CLR   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTB_SET   ((uint32_t)0x00002000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[DMA_PREIRQ_RX] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< Enable DMA Done PREIRQ RX interrupt */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_PREIRQ_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[DMA_PREIRQ_TX] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< Enable DMA Done PREIRQ TX interrupt */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_PREIRQ_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CT_CPU_INT_IMASK_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[RXFULL] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_RXFULL_OFS     (4)                             /* !< RXFULL Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_RXFULL_MASK    ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an Target RX FIFO is full. */
#define UNICOMMI2CT_CPU_INT_IMASK_RXFULL_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_RXFULL_SET     ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[TXEMPTY] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_TXEMPTY_OFS    (5)                             /* !< TXEMPTY Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_TXEMPTY_MASK   ((uint32_t)0x00000020U)         /* !< Target Transmit FIFO Empty
                                                                                    interrupt mask. This interrupt is set
                                                                                    if all data in the Transmit FIFO have
                                                                                    been shifted out and the transmit
                                                                                    goes into idle mode. */
#define UNICOMMI2CT_CPU_INT_IMASK_TXEMPTY_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_TXEMPTY_SET    ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[TX_UNFL] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_TX_UNFL_OFS    (6)                             /* !< TX_UNFL Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_TX_UNFL_MASK   ((uint32_t)0x00000040U)         /* !< Target TX FIFO underflow */
#define UNICOMMI2CT_CPU_INT_IMASK_TX_UNFL_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_TX_UNFL_SET    ((uint32_t)0x00000040U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[RX_OVFL] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_RX_OVFL_OFS    (7)                             /* !< RX_OVFL Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_RX_OVFL_MASK   ((uint32_t)0x00000080U)         /* !< Target RX FIFO overflow */
#define UNICOMMI2CT_CPU_INT_IMASK_RX_OVFL_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_RX_OVFL_SET    ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_IMASK[ARBLOST] Bits */
#define UNICOMMI2CT_CPU_INT_IMASK_ARBLOST_OFS    (17)                            /* !< ARBLOST Offset */
#define UNICOMMI2CT_CPU_INT_IMASK_ARBLOST_MASK   ((uint32_t)0x00020000U)         /* !< Arbitration Lost Interrupt */
#define UNICOMMI2CT_CPU_INT_IMASK_ARBLOST_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_IMASK_ARBLOST_SET    ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CT_CPU_INT_RIS Bits */
/* UNICOMMI2CT_CPU_INT_RIS[RXDONE] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_RXDONE_OFS       (0)                             /* !< RXDONE Offset */
#define UNICOMMI2CT_CPU_INT_RIS_RXDONE_MASK      ((uint32_t)0x00000001U)         /* !< Receive Done Interrupt: Set after a
                                                                                    byte is received */
#define UNICOMMI2CT_CPU_INT_RIS_RXDONE_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_RIS_RXDONE_SET       ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_RIS[TXDONE] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_TXDONE_OFS       (1)                             /* !< TXDONE Offset */
#define UNICOMMI2CT_CPU_INT_RIS_TXDONE_MASK      ((uint32_t)0x00000002U)         /* !< Transmission Done Interrupt: Set
                                                                                    after a byte is transmitted */
#define UNICOMMI2CT_CPU_INT_RIS_TXDONE_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_RIS_TXDONE_SET       ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_RIS[GENCALL] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_GENCALL_OFS      (8)                             /* !< GENCALL Offset */
#define UNICOMMI2CT_CPU_INT_RIS_GENCALL_MASK     ((uint32_t)0x00000100U)         /* !< General Call Interrupt: set when a
                                                                                    general call is received */
#define UNICOMMI2CT_CPU_INT_RIS_GENCALL_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_RIS_GENCALL_SET      ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_RIS[RXTRG] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_RXTRG_OFS        (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CT_CPU_INT_RIS_RXTRG_MASK       ((uint32_t)0x00000004U)         /* !< Receive Trigger 				    When FIFO
                                                                                    is present, triggered as per IFLS
                                                                                    settings 				    when FIFO is not
                                                                                    present, this indicates when buffer
                                                                                    is full */
#define UNICOMMI2CT_CPU_INT_RIS_RXTRG_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_RIS_RXTRG_SET        ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_RIS[TXTRG] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_TXTRG_OFS        (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CT_CPU_INT_RIS_TXTRG_MASK       ((uint32_t)0x00000008U)         /* !< Transmit Trigger     When FIFO is
                                                                                    present, triggered as per IFLS
                                                                                    settings
                                                                                    When FIFO is not present, trigger
                                                                                    when transmit buffer is empty */
#define UNICOMMI2CT_CPU_INT_RIS_TXTRG_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_RIS_TXTRG_SET        ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_RIS[START] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_START_OFS        (9)                             /* !< START Offset */
#define UNICOMMI2CT_CPU_INT_RIS_START_MASK       ((uint32_t)0x00000200U)         /* !< Start Condition Interrupt: is set
                                                                                    after a START condition is received
                                                                                    and this target is addressed */
#define UNICOMMI2CT_CPU_INT_RIS_START_CLR        ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define UNICOMMI2CT_CPU_INT_RIS_START_SET        ((uint32_t)0x00000200U)         /* !< Set when a START condition is
                                                                                    receivied and address matches
                                                                                    target's address */
/* UNICOMMI2CT_CPU_INT_RIS[STOP] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_STOP_OFS         (10)                            /* !< STOP Offset */
#define UNICOMMI2CT_CPU_INT_RIS_STOP_MASK        ((uint32_t)0x00000400U)         /* !< Stop Condition Interrupt: set on a
                                                                                    STOP condition if this target was
                                                                                    being addressed */
#define UNICOMMI2CT_CPU_INT_RIS_STOP_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt */
#define UNICOMMI2CT_CPU_INT_RIS_STOP_SET         ((uint32_t)0x00000400U)         /* !< Interrupt is set when target is
                                                                                    addressed and STOP condition is
                                                                                    received */
/* UNICOMMI2CT_CPU_INT_RIS[DMA_DONE_TX] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_DONE_TX_OFS  (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_DONE_TX_CLR  ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_DONE_TX_SET  ((uint32_t)0x00010000U)         /* !< Set interrupt */
/* UNICOMMI2CT_CPU_INT_RIS[DMA_DONE_RX] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_DONE_RX_OFS  (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_DONE_RX_CLR  ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_DONE_RX_SET  ((uint32_t)0x00008000U)         /* !< Set interrupt */
/* UNICOMMI2CT_CPU_INT_RIS[PEC_RX_ERR] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_PEC_RX_ERR_OFS   (11)                            /* !< PEC_RX_ERR Offset */
#define UNICOMMI2CT_CPU_INT_RIS_PEC_RX_ERR_MASK  ((uint32_t)0x00000800U)         /* !< RX Pec Error Interrupt */
#define UNICOMMI2CT_CPU_INT_RIS_PEC_RX_ERR_CLR   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_RIS_PEC_RX_ERR_SET   ((uint32_t)0x00000800U)         /* !< Interrupt ocuured */
/* UNICOMMI2CT_CPU_INT_RIS[TIMEOUTA] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_TIMEOUTA_OFS     (12)                            /* !< TIMEOUTA Offset */
#define UNICOMMI2CT_CPU_INT_RIS_TIMEOUTA_MASK    ((uint32_t)0x00001000U)         /* !< Timeout A Interrupt */
#define UNICOMMI2CT_CPU_INT_RIS_TIMEOUTA_CLR     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_RIS_TIMEOUTA_SET     ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_RIS[TIMEOUTB] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_TIMEOUTB_OFS     (13)                            /* !< TIMEOUTB Offset */
#define UNICOMMI2CT_CPU_INT_RIS_TIMEOUTB_MASK    ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define UNICOMMI2CT_CPU_INT_RIS_TIMEOUTB_CLR     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_RIS_TIMEOUTB_SET     ((uint32_t)0x00002000U)         /* !< Interrupt occured */
/* UNICOMMI2CT_CPU_INT_RIS[DMA_PREIRQ_RX] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_PREIRQ_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Interrupt occured */
/* UNICOMMI2CT_CPU_INT_RIS[DMA_PREIRQ_TX] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_PREIRQ_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CT_CPU_INT_RIS_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Interrupt occured */
/* UNICOMMI2CT_CPU_INT_RIS[RXFULL] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_RXFULL_OFS       (4)                             /* !< RXFULL Offset */
#define UNICOMMI2CT_CPU_INT_RIS_RXFULL_MASK      ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define UNICOMMI2CT_CPU_INT_RIS_RXFULL_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_RIS_RXFULL_SET       ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* UNICOMMI2CT_CPU_INT_RIS[TXEMPTY] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_TXEMPTY_OFS      (5)                             /* !< TXEMPTY Offset */
#define UNICOMMI2CT_CPU_INT_RIS_TXEMPTY_MASK     ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty Interrupt.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and FSM goes into idle mode. */
#define UNICOMMI2CT_CPU_INT_RIS_TXEMPTY_CLR      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_RIS_TXEMPTY_SET      ((uint32_t)0x00000020U)         /* !< Interrupt occured */
/* UNICOMMI2CT_CPU_INT_RIS[TX_UNFL] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_TX_UNFL_OFS      (6)                             /* !< TX_UNFL Offset */
#define UNICOMMI2CT_CPU_INT_RIS_TX_UNFL_MASK     ((uint32_t)0x00000040U)         /* !< Transmit FIFO underflow */
#define UNICOMMI2CT_CPU_INT_RIS_TX_UNFL_CLR      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_RIS_TX_UNFL_SET      ((uint32_t)0x00000040U)         /* !< Interrupt occured */
/* UNICOMMI2CT_CPU_INT_RIS[RX_OVFL] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_RX_OVFL_OFS      (7)                             /* !< RX_OVFL Offset */
#define UNICOMMI2CT_CPU_INT_RIS_RX_OVFL_MASK     ((uint32_t)0x00000080U)         /* !< Receive FIFO overflow */
#define UNICOMMI2CT_CPU_INT_RIS_RX_OVFL_CLR      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_RIS_RX_OVFL_SET      ((uint32_t)0x00000080U)         /* !< Interrupt Occured */
/* UNICOMMI2CT_CPU_INT_RIS[ARBLOST] Bits */
#define UNICOMMI2CT_CPU_INT_RIS_ARBLOST_OFS      (17)                            /* !< ARBLOST Offset */
#define UNICOMMI2CT_CPU_INT_RIS_ARBLOST_MASK     ((uint32_t)0x00020000U)         /* !< Arbitration Lost Interrupt */
#define UNICOMMI2CT_CPU_INT_RIS_ARBLOST_CLR      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_RIS_ARBLOST_SET      ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */

