TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_unicommi2ct.h
/* UNICOMMI2CT_CPU_INT_MIS Bits */
/* UNICOMMI2CT_CPU_INT_MIS[RXDONE] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_RXDONE_OFS       (0)                             /* !< RXDONE Offset */
#define UNICOMMI2CT_CPU_INT_MIS_RXDONE_MASK      ((uint32_t)0x00000001U)         /* !< Receive Data Interrupt Signals that
                                                                                    a byte has been received */
#define UNICOMMI2CT_CPU_INT_MIS_RXDONE_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_MIS_RXDONE_SET       ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_MIS[TXDONE] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_TXDONE_OFS       (1)                             /* !< TXDONE Offset */
#define UNICOMMI2CT_CPU_INT_MIS_TXDONE_MASK      ((uint32_t)0x00000002U)         /* !< Transmit Transaction completed
                                                                                    Interrupt */
#define UNICOMMI2CT_CPU_INT_MIS_TXDONE_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_MIS_TXDONE_SET       ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_MIS[GENCALL] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_GENCALL_OFS      (8)                             /* !< GENCALL Offset */
#define UNICOMMI2CT_CPU_INT_MIS_GENCALL_MASK     ((uint32_t)0x00000100U)         /* !< General Call Interrupt */
#define UNICOMMI2CT_CPU_INT_MIS_GENCALL_CLR      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_MIS_GENCALL_SET      ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_MIS[RXTRG] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_RXTRG_OFS        (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CT_CPU_INT_MIS_RXTRG_MASK       ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CT_CPU_INT_MIS_RXTRG_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_MIS_RXTRG_SET        ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_MIS[TXTRG] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_TXTRG_OFS        (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CT_CPU_INT_MIS_TXTRG_MASK       ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CT_CPU_INT_MIS_TXTRG_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_MIS_TXTRG_SET        ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_MIS[START] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_START_OFS        (9)                             /* !< START Offset */
#define UNICOMMI2CT_CPU_INT_MIS_START_MASK       ((uint32_t)0x00000200U)         /* !< START Detection Interrupt */
#define UNICOMMI2CT_CPU_INT_MIS_START_CLR        ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define UNICOMMI2CT_CPU_INT_MIS_START_SET        ((uint32_t)0x00000200U)         /* !< Set MIS */
/* UNICOMMI2CT_CPU_INT_MIS[STOP] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_STOP_OFS         (10)                            /* !< STOP Offset */
#define UNICOMMI2CT_CPU_INT_MIS_STOP_MASK        ((uint32_t)0x00000400U)         /* !< STOP Detection Interrupt */
#define UNICOMMI2CT_CPU_INT_MIS_STOP_CLR         ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define UNICOMMI2CT_CPU_INT_MIS_STOP_SET         ((uint32_t)0x00000400U)         /* !< Set MIS */
/* UNICOMMI2CT_CPU_INT_MIS[DMA_DONE_TX] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_DONE_TX_OFS  (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_DONE_TX_CLR  ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_DONE_TX_SET  ((uint32_t)0x00010000U)         /* !< Set MIS */
/* UNICOMMI2CT_CPU_INT_MIS[DMA_DONE_RX] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_DONE_RX_OFS  (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_DONE_RX_CLR  ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_DONE_RX_SET  ((uint32_t)0x00008000U)         /* !< Set MIS */
/* UNICOMMI2CT_CPU_INT_MIS[PEC_RX_ERR] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_PEC_RX_ERR_OFS   (11)                            /* !< PEC_RX_ERR Offset */
#define UNICOMMI2CT_CPU_INT_MIS_PEC_RX_ERR_MASK  ((uint32_t)0x00000800U)         /* !< Target RX Pec Error Interrupt */
#define UNICOMMI2CT_CPU_INT_MIS_PEC_RX_ERR_CLR   ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define UNICOMMI2CT_CPU_INT_MIS_PEC_RX_ERR_SET   ((uint32_t)0x00000800U)         /* !< Set interrupt mask */
/* UNICOMMI2CT_CPU_INT_MIS[TIMEOUTA] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_TIMEOUTA_OFS     (12)                            /* !< TIMEOUTA Offset */
#define UNICOMMI2CT_CPU_INT_MIS_TIMEOUTA_MASK    ((uint32_t)0x00001000U)         /* !< Timeout A Interrupt */
#define UNICOMMI2CT_CPU_INT_MIS_TIMEOUTA_CLR     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_MIS_TIMEOUTA_SET     ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CT_CPU_INT_MIS[TIMEOUTB] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_TIMEOUTB_OFS     (13)                            /* !< TIMEOUTB Offset */
#define UNICOMMI2CT_CPU_INT_MIS_TIMEOUTB_MASK    ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define UNICOMMI2CT_CPU_INT_MIS_TIMEOUTB_CLR     ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define UNICOMMI2CT_CPU_INT_MIS_TIMEOUTB_SET     ((uint32_t)0x00002000U)         /* !< Set interrupt mask */
/* UNICOMMI2CT_CPU_INT_MIS[DMA_PREIRQ_RX] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< Masked DMA PREIRQ Done on RX Event
                                                                                    Channel Interrupt */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_PREIRQ_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Interrupt occured */
/* UNICOMMI2CT_CPU_INT_MIS[DMA_PREIRQ_TX] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< Masked DMA Done PREIRQ on TX Event
                                                                                    Channel Interrupt */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_PREIRQ_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_MIS_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Interrupt occured */
/* UNICOMMI2CT_CPU_INT_MIS[RXFULL] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_RXFULL_OFS       (4)                             /* !< RXFULL Offset */
#define UNICOMMI2CT_CPU_INT_MIS_RXFULL_MASK      ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define UNICOMMI2CT_CPU_INT_MIS_RXFULL_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_CPU_INT_MIS_RXFULL_SET       ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* UNICOMMI2CT_CPU_INT_MIS[TXEMPTY] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_TXEMPTY_OFS      (5)                             /* !< TXEMPTY Offset */
#define UNICOMMI2CT_CPU_INT_MIS_TXEMPTY_MASK     ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define UNICOMMI2CT_CPU_INT_MIS_TXEMPTY_CLR      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_MIS_TXEMPTY_SET      ((uint32_t)0x00000020U)         /* !< Interrupt occured */
/* UNICOMMI2CT_CPU_INT_MIS[TX_UNFL] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_TX_UNFL_OFS      (6)                             /* !< TX_UNFL Offset */
#define UNICOMMI2CT_CPU_INT_MIS_TX_UNFL_MASK     ((uint32_t)0x00000040U)         /* !< Target TX FIFO underflow */
#define UNICOMMI2CT_CPU_INT_MIS_TX_UNFL_CLR      ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define UNICOMMI2CT_CPU_INT_MIS_TX_UNFL_SET      ((uint32_t)0x00000040U)         /* !< Set interrupt mask */
/* UNICOMMI2CT_CPU_INT_MIS[RX_OVFL] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_RX_OVFL_OFS      (7)                             /* !< RX_OVFL Offset */
#define UNICOMMI2CT_CPU_INT_MIS_RX_OVFL_MASK     ((uint32_t)0x00000080U)         /* !< Target RX FIFO overflow */
#define UNICOMMI2CT_CPU_INT_MIS_RX_OVFL_CLR      ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define UNICOMMI2CT_CPU_INT_MIS_RX_OVFL_SET      ((uint32_t)0x00000080U)         /* !< Set interrupt mask */
/* UNICOMMI2CT_CPU_INT_MIS[ARBLOST] Bits */
#define UNICOMMI2CT_CPU_INT_MIS_ARBLOST_OFS      (17)                            /* !< ARBLOST Offset */
#define UNICOMMI2CT_CPU_INT_MIS_ARBLOST_MASK     ((uint32_t)0x00020000U)         /* !< Arbitration Lost Interrupt */
#define UNICOMMI2CT_CPU_INT_MIS_ARBLOST_CLR      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMI2CT_CPU_INT_MIS_ARBLOST_SET      ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */

