TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_unicommi2ct.h
/* UNICOMMI2CT_IFLS Bits */
/* UNICOMMI2CT_IFLS[TXIFLSEL] Bits */
#define UNICOMMI2CT_IFLS_TXIFLSEL_OFS            (0)                             /* !< TXIFLSEL Offset */
#define UNICOMMI2CT_IFLS_TXIFLSEL_MASK           ((uint32_t)0x00000007U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define UNICOMMI2CT_IFLS_TXIFLSEL_LVL_3_4        ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define UNICOMMI2CT_IFLS_TXIFLSEL_LVL_1_2        ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define UNICOMMI2CT_IFLS_TXIFLSEL_LVL_1_4        ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define UNICOMMI2CT_IFLS_TXIFLSEL_LVL_NOT_FULL   ((uint32_t)0x00000004U)         /* !< Opposite of full */
#define UNICOMMI2CT_IFLS_TXIFLSEL_LVL_EMPTY      ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define UNICOMMI2CT_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000006U)         /* !< TX FIFO <= 1 */
#define UNICOMMI2CT_IFLS_TXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000007U)         /* !< TX_FIFO >= (MAX_FIFO_LEN -1) */
/* UNICOMMI2CT_IFLS[RXIFLSEL] Bits */
#define UNICOMMI2CT_IFLS_RXIFLSEL_OFS            (4)                             /* !< RXIFLSEL Offset */
#define UNICOMMI2CT_IFLS_RXIFLSEL_MASK           ((uint32_t)0x00000070U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define UNICOMMI2CT_IFLS_RXIFLSEL_LVL_1_4        ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define UNICOMMI2CT_IFLS_RXIFLSEL_LVL_1_2        ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define UNICOMMI2CT_IFLS_RXIFLSEL_LVL_3_4        ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define UNICOMMI2CT_IFLS_RXIFLSEL_LVL_NOT_EMPTY  ((uint32_t)0x00000040U)         /* !< Opposite of empty */
#define UNICOMMI2CT_IFLS_RXIFLSEL_LVL_FULL       ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define UNICOMMI2CT_IFLS_RXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000060U)         /* !< RX_FIFO >= (MAX_FIFO_LEN -1) */
#define UNICOMMI2CT_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000070U)         /* !< RX_FIFO <= 1 */
/* UNICOMMI2CT_IFLS[TXCLR] Bits */
#define UNICOMMI2CT_IFLS_TXCLR_OFS               (3)                             /* !< TXCLR Offset */
#define UNICOMMI2CT_IFLS_TXCLR_MASK              ((uint32_t)0x00000008U)         /* !< TX FIFO CLEAR. Setting this bit
                                                                                    will clear the TX FIFO contents. */
#define UNICOMMI2CT_IFLS_TXCLR_DISABLE           ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define UNICOMMI2CT_IFLS_TXCLR_ENABLE            ((uint32_t)0x00000008U)         /* !< Enable FIFO Clear */
/* UNICOMMI2CT_IFLS[RXCLR] Bits */
#define UNICOMMI2CT_IFLS_RXCLR_OFS               (7)                             /* !< RXCLR Offset */
#define UNICOMMI2CT_IFLS_RXCLR_MASK              ((uint32_t)0x00000080U)         /* !< RX FIFO CLEAR. Setting this bit
                                                                                    will clear the RX FIFO contents. */
#define UNICOMMI2CT_IFLS_RXCLR_DISABLE           ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define UNICOMMI2CT_IFLS_RXCLR_ENABLE            ((uint32_t)0x00000080U)         /* !< Enable FIFO Clear */

/* UNICOMMI2CT_GFCTL Bits */
/* UNICOMMI2CT_GFCTL[DGFSEL] Bits */
#define UNICOMMI2CT_GFCTL_DGFSEL_OFS             (0)                             /* !< DGFSEL Offset */
#define UNICOMMI2CT_GFCTL_DGFSEL_MASK            ((uint32_t)0x00000007U)         /* !< Glitch Suppression Pulse Width This
                                                                                    field controls the pulse width select
                                                                                    for glitch suppression on the SCL and
                                                                                    SDA lines. The following values are
                                                                                    the glitch suppression values in
                                                                                    terms of functional clocks. (Core
                                                                                    Domain only) */
#define UNICOMMI2CT_GFCTL_DGFSEL_DISABLED        ((uint32_t)0x00000000U)         /* !< Bypass */
#define UNICOMMI2CT_GFCTL_DGFSEL_CLK_1           ((uint32_t)0x00000001U)         /* !< 1 clock */
#define UNICOMMI2CT_GFCTL_DGFSEL_CLK_2           ((uint32_t)0x00000002U)         /* !< 2 clocks */
#define UNICOMMI2CT_GFCTL_DGFSEL_CLK_3           ((uint32_t)0x00000003U)         /* !< 3 clocks */
#define UNICOMMI2CT_GFCTL_DGFSEL_CLK_4           ((uint32_t)0x00000004U)         /* !< 4 clocks */
#define UNICOMMI2CT_GFCTL_DGFSEL_CLK_8           ((uint32_t)0x00000005U)         /* !< 8 clocks */
#define UNICOMMI2CT_GFCTL_DGFSEL_CLK_16          ((uint32_t)0x00000006U)         /* !< 16 clocks */
#define UNICOMMI2CT_GFCTL_DGFSEL_CLK_31          ((uint32_t)0x00000007U)         /* !< 31 clocks */
/* UNICOMMI2CT_GFCTL[AGFEN] Bits */
#define UNICOMMI2CT_GFCTL_AGFEN_OFS              (8)                             /* !< AGFEN Offset */
#define UNICOMMI2CT_GFCTL_AGFEN_MASK             ((uint32_t)0x00000100U)         /* !< Analog Glitch Suppression Enable */
#define UNICOMMI2CT_GFCTL_AGFEN_DISABLE          ((uint32_t)0x00000000U)         /* !< Analog Glitch Filter disable */
#define UNICOMMI2CT_GFCTL_AGFEN_ENABLE           ((uint32_t)0x00000100U)         /* !< Analog Glitch Filter enable */

/* UNICOMMI2CT_TTXDATA Bits */
/* UNICOMMI2CT_TTXDATA[DATA] Bits */
#define UNICOMMI2CT_TTXDATA_DATA_OFS             (0)                             /* !< DATA Offset */
#define UNICOMMI2CT_TTXDATA_DATA_MASK            ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define UNICOMMI2CT_TTXDATA_DATA_MINIMUM         ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CT_TTXDATA_DATA_MAXIMUM         ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* UNICOMMI2CT_RXDATA Bits */
/* UNICOMMI2CT_RXDATA[DATA] Bits */
#define UNICOMMI2CT_RXDATA_DATA_OFS              (0)                             /* !< DATA Offset */
#define UNICOMMI2CT_RXDATA_DATA_MASK             ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define UNICOMMI2CT_RXDATA_DATA_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CT_RXDATA_DATA_MAXIMUM          ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* UNICOMMI2CT_PECSR Bits */
/* UNICOMMI2CT_PECSR[PECBYTECNT] Bits */
#define UNICOMMI2CT_PECSR_PECBYTECNT_OFS         (0)                             /* !< PECBYTECNT Offset */
#define UNICOMMI2CT_PECSR_PECBYTECNT_MASK        ((uint32_t)0x000001FFU)         /* !< This is the current PEC Byte Count
                                                                                    of the State Machine. */
#define UNICOMMI2CT_PECSR_PECBYTECNT_MINIMUM     ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define UNICOMMI2CT_PECSR_PECBYTECNT_MAXIMUM     ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* UNICOMMI2CT_PECSR[PECSTS_CHECK] Bits */
#define UNICOMMI2CT_PECSR_PECSTS_CHECK_OFS       (16)                            /* !< PECSTS_CHECK Offset */
#define UNICOMMI2CT_PECSR_PECSTS_CHECK_MASK      ((uint32_t)0x00010000U)         /* !< This status bit indicates if the
                                                                                    PEC was checked in the transaction
                                                                                    that occurred before the last Stop.
                                                                                    Latched on Stop. */
#define UNICOMMI2CT_PECSR_PECSTS_CHECK_CLEARED   ((uint32_t)0x00000000U)         /* !< Indicates PEC was not checked in
                                                                                    the transaction that occurred before
                                                                                    the last Stop */
#define UNICOMMI2CT_PECSR_PECSTS_CHECK_SET       ((uint32_t)0x00010000U)         /* !< Indicates PEC was checked in the
                                                                                    transaction that occurred before the
                                                                                    last Stop */
/* UNICOMMI2CT_PECSR[PECSTS_ERROR] Bits */
#define UNICOMMI2CT_PECSR_PECSTS_ERROR_OFS       (17)                            /* !< PECSTS_ERROR Offset */
#define UNICOMMI2CT_PECSR_PECSTS_ERROR_MASK      ((uint32_t)0x00020000U)         /* !< This status bit indicates if a PEC
                                                                                    check error occurred in the
                                                                                    transaction that occurred before the
                                                                                    last Stop. Latched on Stop. */
#define UNICOMMI2CT_PECSR_PECSTS_ERROR_CLEARED   ((uint32_t)0x00000000U)         /* !< Indicates PEC check error did not
                                                                                    occurr in the transaction that
                                                                                    occurred before the last Stop */
#define UNICOMMI2CT_PECSR_PECSTS_ERROR_SET       ((uint32_t)0x00020000U)         /* !< Indicates PEC check error occurred
                                                                                    in the transaction that occurred
                                                                                    before the last Stop */

/* UNICOMMI2CT_OAR2 Bits */
/* UNICOMMI2CT_OAR2[OAR2] Bits */
#define UNICOMMI2CT_OAR2_OAR2_OFS                (0)                             /* !< OAR2 Offset */
#define UNICOMMI2CT_OAR2_OAR2_MASK               ((uint32_t)0x0000007FU)         /* !< Own Address 2This field specifies
                                                                                    the alternate OAR2 address. */
#define UNICOMMI2CT_OAR2_OAR2_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CT_OAR2_OAR2_MAXIMUM            ((uint32_t)0x0000007FU)         /* !< Highest possible value */
/* UNICOMMI2CT_OAR2[OAR2EN] Bits */
#define UNICOMMI2CT_OAR2_OAR2EN_OFS              (7)                             /* !< OAR2EN Offset */
#define UNICOMMI2CT_OAR2_OAR2EN_MASK             ((uint32_t)0x00000080U)         /* !< Own Address 2 Enable */
#define UNICOMMI2CT_OAR2_OAR2EN_DISABLE          ((uint32_t)0x00000000U)         /* !< The alternate address is disabled. */
#define UNICOMMI2CT_OAR2_OAR2EN_ENABLE           ((uint32_t)0x00000080U)         /* !< Enables the use of the alternate
                                                                                    address in the OAR2 field. */
/* UNICOMMI2CT_OAR2[OAR2_MASK] Bits */
#define UNICOMMI2CT_OAR2_OAR2_MASK_OFS           (16)                            /* !< OAR2_MASK Offset */
#define UNICOMMI2CT_OAR2_OAR2_MASK_MASK          ((uint32_t)0x007F0000U)         /* !< Own Address 2 Mask: This field
                                                                                    specifies bits A6 through A0 of the
                                                                                    Target address. The bits with value 1
                                                                                    in SOAR2.OAR2_MASK field will make
                                                                                    the corresponding incoming address
                                                                                    bits to match by default regardless
                                                                                    of the value inside SOAR2.OAR2 i.e.
                                                                                    corresponding SOAR2.OAR2 bit is a
                                                                                    dont care. */
#define UNICOMMI2CT_OAR2_OAR2_MASK_MINIMUM       ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define UNICOMMI2CT_OAR2_OAR2_MASK_MAXIMUM       ((uint32_t)0x007F0000U)         /* !< Maximum Value */

