TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_unicommi2ct.h
/* UNICOMMI2CT_OAR Bits */
/* UNICOMMI2CT_OAR[OAR] Bits */
#define UNICOMMI2CT_OAR_OAR_OFS                  (0)                             /* !< OAR Offset */
#define UNICOMMI2CT_OAR_OAR_MASK                 ((uint32_t)0x000003FFU)         /* !< Own Address: This field specifies
                                                                                    bits A9 through A0 of the Target
                                                                                    address. In 7-bit addressing mode as
                                                                                    selected by I2CSOAR.MODE bit, the top
                                                                                    3 bits are don't care */
#define UNICOMMI2CT_OAR_OAR_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CT_OAR_OAR_MAXIMUM              ((uint32_t)0x000003FFU)         /* !< Highest possible value */
/* UNICOMMI2CT_OAR[OAREN] Bits */
#define UNICOMMI2CT_OAR_OAREN_OFS                (14)                            /* !< OAREN Offset */
#define UNICOMMI2CT_OAR_OAREN_MASK               ((uint32_t)0x00004000U)         /* !< Own Address Enable */
#define UNICOMMI2CT_OAR_OAREN_DISABLE            ((uint32_t)0x00000000U)         /* !< Disable OAR address */
#define UNICOMMI2CT_OAR_OAREN_ENABLE             ((uint32_t)0x00004000U)         /* !< Enable OAR address */
/* UNICOMMI2CT_OAR[MODE] Bits */
#define UNICOMMI2CT_OAR_MODE_OFS                 (15)                            /* !< MODE Offset */
#define UNICOMMI2CT_OAR_MODE_MASK                ((uint32_t)0x00008000U)         /* !< This bit selects the adressing mode
                                                                                    to be used. When 0, 7-bit addressing
                                                                                    is used. When 1, 10-bit addressing is
                                                                                    used. */
#define UNICOMMI2CT_OAR_MODE_MODE7               ((uint32_t)0x00000000U)         /* !< Enable 7-bit addressing */
#define UNICOMMI2CT_OAR_MODE_MODE10              ((uint32_t)0x00008000U)         /* !< Enable 10-bit addressing */

/* UNICOMMI2CT_TIMEOUT_CNT Bits */
/* UNICOMMI2CT_TIMEOUT_CNT[TCNTA] Bits */
#define UNICOMMI2CT_TIMEOUT_CNT_TCNTA_OFS        (0)                             /* !< TCNTA Offset */
#define UNICOMMI2CT_TIMEOUT_CNT_TCNTA_MASK       ((uint32_t)0x000000FFU)         /* !< Timeout Count A Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter A */
#define UNICOMMI2CT_TIMEOUT_CNT_TCNTA_MINIMUM    ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define UNICOMMI2CT_TIMEOUT_CNT_TCNTA_MAXIMUM    ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* UNICOMMI2CT_TIMEOUT_CNT[TCNTB] Bits */
#define UNICOMMI2CT_TIMEOUT_CNT_TCNTB_OFS        (16)                            /* !< TCNTB Offset */
#define UNICOMMI2CT_TIMEOUT_CNT_TCNTB_MASK       ((uint32_t)0x00FF0000U)         /* !< Timeout Count B Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter B */
#define UNICOMMI2CT_TIMEOUT_CNT_TCNTB_MINIMUM    ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define UNICOMMI2CT_TIMEOUT_CNT_TCNTB_MAXIMUM    ((uint32_t)0x00FF0000U)         /* !< Highest possible value */

/* UNICOMMI2CT_TIMEOUT_CTL Bits */
/* UNICOMMI2CT_TIMEOUT_CTL[TCNTLA] Bits */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTLA_OFS       (0)                             /* !< TCNTLA Offset */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTLA_MASK      ((uint32_t)0x000000FFU)         /* !< Timeout counter A load value
                                                                                    Counter A is used for SCL low
                                                                                    detection. This field contains the
                                                                                    upper 8 bits of a 12-bit pre-load
                                                                                    value for the Timeout A count. NOTE:
                                                                                    The value of CNTLA must be greater
                                                                                    than 1h.   Each count is equal to 520
                                                                                    times the timeout period of
                                                                                    functional clock. For example, with
                                                                                    8MHz functional clock and a 100KHz
                                                                                    operating I2C clock, one timeout
                                                                                    period will be equal to (1 / 8MHz) *
                                                                                    520 or 65 us. */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTLA_MINIMUM   ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTLA_MAXIMUM   ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* UNICOMMI2CT_TIMEOUT_CTL[TCNTAEN] Bits */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTAEN_OFS      (15)                            /* !< TCNTAEN Offset */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTAEN_MASK     ((uint32_t)0x00008000U)         /* !< Timeout Counter A Enable */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTAEN_DISABLE  ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTAEN_ENABLE   ((uint32_t)0x00008000U)         /* !< Enable Timeout Counter B */
/* UNICOMMI2CT_TIMEOUT_CTL[TCNTLB] Bits */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTLB_OFS       (16)                            /* !< TCNTLB Offset */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTLB_MASK      ((uint32_t)0x00FF0000U)         /* !< Timeout Count B Load: Counter B is
                                                                                    used for SCL High Detection. This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit pre-load value for the Timeout
                                                                                    B count. NOTE: The value of CNTLB
                                                                                    must be greater than 1h.   Each count
                                                                                    is equal to 1* clock period. For
                                                                                    example, with 10MHz functional clock
                                                                                    one timeout period will be equal
                                                                                    to1*100ns. */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTLB_MINIMUM   ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTLB_MAXIMUM   ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* UNICOMMI2CT_TIMEOUT_CTL[TCNTBEN] Bits */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTBEN_OFS      (31)                            /* !< TCNTBEN Offset */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTBEN_MASK     ((uint32_t)0x80000000U)         /* !< Timeout Counter B Enable */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTBEN_DISABLE  ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define UNICOMMI2CT_TIMEOUT_CTL_TCNTBEN_ENABLE   ((uint32_t)0x80000000U)         /* !< Enable Timeout Counter B */

/* UNICOMMI2CT_PECCTL Bits */
/* UNICOMMI2CT_PECCTL[PECCNT] Bits */
#define UNICOMMI2CT_PECCTL_PECCNT_OFS            (0)                             /* !< PECCNT Offset */
#define UNICOMMI2CT_PECCTL_PECCNT_MASK           ((uint32_t)0x000001FFU)         /* !< When this field is non zero, the
                                                                                    number of I2C data bytes are counted.
                                                                                    When the byte count = PECCNT and the
                                                                                    state machine is transmitting, the
                                                                                    contents of the LSFR is loaded into
                                                                                    the shift register instead of the
                                                                                    byte received from the Tx FIFO. When
                                                                                    the state machine is receiving, after
                                                                                    the last bit of this byte is received
                                                                                    the LSFR is checked and if it is
                                                                                    non-zero, a PEC RX Error interrupt is
                                                                                    generated. The I2C packet must be
                                                                                    padded to include the PEC byte for
                                                                                    both transmit and receive. In
                                                                                    transmit mode the FIFO must be loaded
                                                                                    with a dummy PEC byte. In receive
                                                                                    mode the PEC byte will be passed to
                                                                                    the Rx FIFO.  In the normal use case,
                                                                                    FW would set PECEN=1 and PECCNT=0 and
                                                                                    use the ACKOEN until the remaining
                                                                                    SMB packet length is known. FW would
                                                                                    then set the PECCNT to the remaining
                                                                                    packet length (Including PEC bye). FW
                                                                                    would then configure DMA to allow the
                                                                                    packet to complete unassisted and
                                                                                    exit NoAck mode.  Note that when the
                                                                                    byte count = PEC CNT, the byte count
                                                                                    is reset to 0 and multiple PEC
                                                                                    calculation can automatically occur
                                                                                    within a single I2C transaction */
#define UNICOMMI2CT_PECCTL_PECCNT_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define UNICOMMI2CT_PECCTL_PECCNT_MAXIMUM        ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* UNICOMMI2CT_PECCTL[PECEN] Bits */
#define UNICOMMI2CT_PECCTL_PECEN_OFS             (12)                            /* !< PECEN Offset */
#define UNICOMMI2CT_PECCTL_PECEN_MASK            ((uint32_t)0x00001000U)         /* !< PEC Enable This bit enables the SMB
                                                                                    Packet Error Checking (PEC). When
                                                                                    enabled the PEC is calculated on all
                                                                                    bits except the Start, Stop, Ack and
                                                                                    Nack. The PEC LSFR and the Byte
                                                                                    Counter is set to 0 when the State
                                                                                    Machine is in the IDLE state, which
                                                                                    occur following a Stop or when a
                                                                                    timeout occurs. The Counter is also
                                                                                    set to 0 after the PEC byte is sent
                                                                                    or received. Note that the NACK is
                                                                                    automatically send following a PEC
                                                                                    byte that results in a PEC error. The
                                                                                    PEC Polynomial is x^8 + x^2 + x^1 +
                                                                                    1. */
#define UNICOMMI2CT_PECCTL_PECEN_DISABLE         ((uint32_t)0x00000000U)         /* !< PEC transmission and check is
                                                                                    disabled */
#define UNICOMMI2CT_PECCTL_PECEN_ENABLE          ((uint32_t)0x00001000U)         /* !< PEC transmission and check is
                                                                                    enabled */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_unicommi2ct__include */
